#ifndef _SXJ103_H
#define _SXJ103_H

#define XJ103_Slaver_MAX_BUF_LEN 255

//*********************************************************************************//
//    控制函数 dwCommand参数宏定义
//*********************************************************************************//
#define TP_YKSELECT    	1    //遥控预置
#define TP_YKOPERATE  	2    //遥控执行
#define TP_YKCANCEL  	3    //遥控撤消
#define TP_YKDIRECT  	4    //遥控直接执行

#define TP_OPEN      	2   //遥控、同期开关属性为分
#define TP_CLOSE      	1   //遥控、同期开关属性为合
#define TP_NULL      	0   //不区分开关属性

#define	PBI_ON			1
#define PBI_OFF			0

//========================================================================
//		时间相关结构
//========================================================================
/*----------------------------------------------------------------------------------------*/
/* 绝对时间格式定义,当前时间为相对于1970年1月1号0时0分0秒0毫秒的总毫秒数                  */
/*----------------------------------------------------------------------------------------*/

int Init_XJ103Slaver(int DevNo);

#endif

